; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	thermograph3 - mode
	infrared2 - mode
	spectrograph0 - mode
	infrared1 - mode
	GroundStation0 - direction
	Star1 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Star2 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star4)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
)
(:goal (and
	(pointing satellite0 Phenomenon12)
	(have_image Star9 infrared2)
	(have_image Star10 thermograph3)
	(have_image Phenomenon11 spectrograph0)
	(have_image Phenomenon12 spectrograph0)
	(have_image Star13 thermograph3)
))

)

; plan
1. (turn_to satellite1 groundstation3 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 6
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
3. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 0 of 6
4. (turn_to satellite1 phenomenon11 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon11)
   goals met: 0 of 6
5. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   goals met: 0 of 6
6. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
7. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 6
8. (take_image satellite1 phenomenon11 instrument2 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 1 of 6
9. (turn_to satellite0 star10 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star10)
   goals met: 1 of 6
10. (take_image satellite0 star10 instrument0 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 2 of 6
11. (turn_to satellite0 star13 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star13)
   goals met: 2 of 6
12. (take_image satellite0 star13 instrument0 thermograph3)
   added: (have_image star13 thermograph3)
   goals met: 3 of 6
13. (turn_to satellite0 phenomenon12 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 6
14. (take_image satellite0 phenomenon12 instrument0 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 5 of 6
15. (turn_to satellite1 star9 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star9)
   goals met: 5 of 6
16. (take_image satellite1 star9 instrument2 infrared2)
   added: (have_image star9 infrared2)
   goals met: 6 of 6
